<details ><summary>plan for staging 2025-03-30 00:26:27 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #2
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_policy.read_only_ecr_access must be replaced
-/+ resource "aws_iam_policy" "read_only_ecr_access" {
      ~ arn         = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply)
      ~ id          = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply)
      ~ name        = "read-only-ecr-access" -> "read-only-ecr-access-renamed" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAX5UQUQ45QXHRBTNCK" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ecr_access_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecr_access_attachment" {
      ~ id         = "ecr-access-20250330002258981600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::544690439995:policy/read-only-ecr-access" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                        RESOURCE                        |
|----------|--------------------------------------------------------|
| recreate | `aws_iam_policy.read_only_ecr_access`                  |
|          | `aws_iam_role_policy_attachment.ecr_access_attachment` |

</details>

</details>